# ETL

**In this phase of the project we will apply an ETL process on previously saved movie data. We will create new MySQL database after preparing the data for a relational database. Finally , we will export database to a .sql file in repository using MySQL.***

<h3>Specifications  - Database</h3>
<ul>
<li>
<p><strong> Stakeholder wants you to leverage the cleaned data from the initial cleaning notebook. And wants you to create a MySQL database for them.</strong></p>
</li>
<li>
<p>You should normalize the tables as best you can before adding them to your new database.</p>
<ul>
<li>Note: an important exception to their request is that they would like you to keep all of the data from the TMDB API in 1 table together (even though it will not be perfectly normalized).&nbsp;&nbsp;</li><li>You only need to keep the imdb_id, revenue, budget, and certification columns</li>
</ul>
</li>
</ul>
<h4>Required Transformation steps:</h4>
<ul>
<li>
<p><strong>Normalize Genre:</strong></p>
<ul>
<li>Convert the single string of genres from title basics into 2 new tables.
<ol>
<li>
<p><code>title_genres</code>:  with the columns:</p>
<ul>
<li>tconst</li>
<li>genre_id</li>
</ul>
</li>
<li>
<p><code>genres</code>:</p>
<ul>
<li>genre_id</li>
<li>genre_name</li>
</ul>
</li>
</ol>
</li>
</ul>
</li>
<li>
<ul>
<li>For the <code>title basics</code> table, drop the following columns:
<ul>
<li>"original_title" (we will use the primary title column instead)</li>
<li>"isAdult" ("Adult" will show up in the genres so this is redundant information).</li>
<li>"titleType" (every row will be a movie).</li>
<li>"genres" and other variants of genre (genre is now represented in the 2 new tables described above.</li>
</ul>
</li>
<li>Do not include the <code>title_akas</code> table in your SQL database.

</li>
</ul>
</li>
</ul>
<h4>MySQL Database Requirements</h4>
<ul>
<p>Create a new database on  MySQL server "movies".</p>
</li>
<li>
<p>Make sure to have the following tables in "movies" database:</p>
<ul>
<li><code>title_basics</code></li>
<li><code>title_ratings</code></li>
<li><code>title_genres</code></li>
<li><code>genres</code></li>
<li><code>tmdb_data</code></li>
</ul>
</li>
<li>
<p>Set a Primary Key for each table.</p>
</li>
<li>
</li>
<li>

<h2>Normalizing Genres</h2>
<ul>
<li>
<ul>
<li>Convert the single string of genres from title basics into 2 new tables.
<ol>
<li>
<p><code>title_genres</code>:  with the columns:</p>
<ul>
<li>tconst</li>
<li>genre_id</li>
</ul>
</li>
<li>
<p><code>genres</code>:</p>
<ul>
<li>genre_id</li>
<li>genre_name</li>
</ul>
</li>
</ol>
</li>
</ul>
</li>
<li>
<p>Creating these tables will be a multi-step process.</p>
<ol>
<li>Getting a list of all individual genres.</li>
<li>Create a new <code>title_genres</code> table with with the movie ids duplicated, once for each genre that a movie belongs to.</li>
<li>Create a mapper dictionary with numeric ids for each genre.</li>
<li>Use the mapper dictionary to replace the string genres in <code>title_genres</code> with numeric genre_ids.</li>
<li>Convert the mapper dictionary into a final <code>genres</code> table with the numeric genre_id and the string genre.</li>
</ol>
</li>
</ul>

<ul>
<li>To use a string column as our primary key, we will need to provide the SQL datatype schema of our columns when we create the table.
<ul>
<li>We will then use our <code>engine</code> to run the command to alter our table and add tconst as the primary key.</li>
</ul>
</li>
</ul>
<h4>1. Creating a dataype schema for <code>to_sql</code>:</h4>
<ul>
<li>
<p><strong>Check the dtypes of your dataframe: (df.dtypes).</strong></p>
<ul>
<li>Create a dictionary with each column name as a key and the corresponding SQL datatype as the value.</li>
</ul>
</li>
<li>
<p><strong>Find the corresponding SQLalchemy datatype to use in the table below.</strong></p>
</li>
</ul>
<table>
<thead>
<tr>
<th>Pandas DataType</th>
<th>SQLAlchemy DataType</th>
</tr>
</thead>
<tbody>
<tr>
<td>int</td>
<td>Integer()</td>
</tr>
<tr>
<td>float</td>
<td>Float()</td>
</tr>
<tr>
<td>bool</td>
<td>Boolean()</td>
</tr>
<tr>
<td>object (for Primary Keys)</td>
<td>String(max_str_len+1)</td>
</tr>
<tr>
<td>object (for non-key columns)</td>
<td>Text(max_str_len+1)</td>
</tr>
</tbody>
</table>

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import os,json
import missingno as ms

plt.rcParams['figure.facecolor'] = 'white'

pd.set_option('display.max_columns',100)

In [2]:
## Folder to save IMDB files
FOLDER = "Data/"
# os.makedirs(FOLDER,exist_ok=True)
sorted(os.listdir(FOLDER))

['final_tmdb_data_2000.csv.gz',
 'final_tmdb_data_2001.csv.gz',
 'final_tmdb_data_2002.csv.gz',
 'title_akas_cleaned.csv.gz',
 'title_basics_cleaned.csv.gz',
 'title_ratings_cleaned.csv.gz',
 'tmdb_api_results_2000.json',
 'tmdb_api_results_2001.json',
 'tmdb_api_results_2002.json']

## Extract: Loading Previous Data

### Title Basics

In [3]:
## title basics
basics = pd.read_csv(f'{FOLDER}title_basics_cleaned.csv.gz',low_memory=False)
basics.info()
basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 138722 entries, 0 to 138721
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          138722 non-null  object
 1   titleType       138722 non-null  object
 2   primaryTitle    138722 non-null  object
 3   originalTitle   138722 non-null  object
 4   isAdult         138722 non-null  int64
 5   startYear       138722 non-null  float64
 6   endYear         0 non-null       float64
 7   runtimeMinutes  138722 non-null  int64
 8   genres          138722 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 9.5+ MB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0082328,movie,Embodiment of Evil,Encarnação do Demônio,0,2008.0,NaN,94,Horror
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"

### Title Ratings

In [4]:
## title ratings
ratings = pd.read_csv(f"{FOLDER}/title_ratings_cleaned.csv.gz",low_memory=False)
ratings.info()
ratings.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 514241 entries, 0 to 514240
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         514241 non-null  object
 1   averageRating  514241 non-null  float64
 2   numVotes       514241 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.8+ MB

      tconst  averageRating  numVotes
0  tt0000001            5.7      2007
1  tt0000002            5.8       269
2  tt0000005            6.2      2692
3  tt0000006            5.0       182
4  tt0000007            5.4       841

### TMDB API Results

- Students should have combined the years 2000 and 2001 as part of Part 2. I forgot to do so so I am doing here

In [5]:
## INSTRUCTOR CODE (not taught to students)
import glob
q = f"{FOLDER}final*.csv.gz"
files = glob.glob(q)
files

['Data/final_tmdb_data_2000.csv.gz',
 'Data/final_tmdb_data_2002.csv.gz',
 'Data/final_tmdb_data_2001.csv.gz']

In [6]:
## INSTRUCTOR CODE (not taught to students)
df = pd.concat([pd.read_csv(f, lineterminator='\n') for f in files])
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6992 entries, 0 to 2358
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                6992 non-null   object
 1   adult                  6989 non-null   float64
 2   backdrop_path          3157 non-null   object
 3   belongs_to_collection  408 non-null    object
 4   budget                 6989 non-null   float64
 5   genres                 6989 non-null   object
 6   homepage               376 non-null    object
 7   id                     6989 non-null   float64
 8   original_language      6989 non-null   object
 9   original_title         6989 non-null   object
 10  overview               6440 non-null   object
 11  popularity             6989 non-null   float64
 12  poster_path            5977 non-null   object
 13  production_companies   6989 non-null   object
 14  production_countries   6989 non-null   object
 15  release_date           6902 non-null   object
 16  revenue                6989 non-null   float64
 17  runtime                6989 non-null   float64
 18  spoken_languages       6989 non-null   object
 19  status                 6989 non-null   object
 20  tagline                1956 non-null   object
 21  title                  6989 non-null   object
 22  video                  6989 non-null   float64
 23  vote_average           6989 non-null   float64
 24  vote_count             6989 non-null   float64
 25  certification          1256 non-null   object
dtypes: float64(9), object(17)
memory usage: 1.4+ MB

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,overview,popularity,poster_path,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,Two rural teens sing and dance their way throu...,2.838,/hfO64mXz3DgUxkBVU7no2UWRP7x.jpg,"[{'id': 60, 'logo_path': '/2eqFolQI0NLL7ExZts5...","[{'iso_3166_1': 'US', 'name': 'United States o...",2000-09-22,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,Earth is in a state of constant war and two co...,2.410,/h9bWO13nWRGZJo4XVPiElXyrRMU.jpg,"[{'id': 925, 'logo_path': '/dIb9hjXNOkgxu4kBWd...","[{'iso_3166_1': 'US', 'name': 'United States o...",2000-11-15,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.1,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,"After falling prey to underworld, four friends...",0.655,/yB5wRu4uyXXwZA3PEj8cITu0xt3.jpg,[],"[{'iso_3166_1': 'IN', 'name': 'India'}]",2000-04-14,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,0.0,0.0,NaN
4,tt0116748,0.0,/wr0hTHwkYIRC82MwNbhOvqrw27N.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,579396.0,hi,Karobaar,Wealthy Rajiv Sinha and middle-classed Amar Sa...,0.600,/wFSOXXrJklY2ngjIJCus9c2DfJW.jpg,[],[],2000-09-15,0.0,180.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,The Business of Love,Karobaar,0.0,5.5,2.0,NaN

In [7]:
## Dropping Placeholder rows with id=0
df = df.loc[ df['imdb_id']!='0']
df

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,overview,popularity,poster_path,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,Two rural teens sing and dance their way throu...,2.838,/hfO64mXz3DgUxkBVU7no2UWRP7x.jpg,"[{'id': 60, 'logo_path': '/2eqFolQI0NLL7ExZts5...","[{'iso_3166_1': 'US', 'name': 'United States o...",2000-09-22,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,Earth is in a state of constant war and two co...,2.410,/h9bWO13nWRGZJo4XVPiElXyrRMU.jpg,"[{'id': 925, 'logo_path': '/dIb9hjXNOkgxu4kBWd...","[{'iso_3166_1': 'US', 'name': 'United States o...",2000-11-15,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,"After falling prey to underworld, four friends...",0.655,/yB5wRu4uyXXwZA3PEj8cITu0xt3.jpg,[],"[{'iso_3166_1': 'IN', 'name': 'India'}]",2000-04-14,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,0.000,0.0,NaN
4,tt0116748,0.0,/wr0hTHwkYIRC82MwNbhOvqrw27N.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,579396.0,hi,Karobaar,Wealthy Rajiv Sinha and middle-classed Amar Sa...,0.600,/wFSOXXrJklY2ngjIJCus9c2DfJW.jpg,[],[],2000-09-15,0.0,180.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,The Business of Love,Karobaar,0.0,5.500,2.0,NaN
5,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,"Hong Kong, 1962: Chow Mo-Wan and Su Li-Zhen mo...",21.023,/iYypPT4bhqXfq1b6EnmxvRt6b2Y.jpg,"[{'id': 539, 'logo_path': None, 'name': 'Block...","[{'iso_3166_1': 'FR', 'name': 'France'}, {'iso...",2000-09-29,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.111,1979.0,PG
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2354,tt6103018,0.0,NaN,NaN,0.0,[],NaN,895123.0,ru,Ахиллесова пята,NaN,0.600,NaN,"[{'id': 69587, 'logo_path': '/u0Jy8wJ05m3MZCNi...",[],2006-01-01,0.0,0.0,[],Released,NaN,Ахиллесова пята,0.0,0.000,0.0,NaN
2355,tt6536876,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}]",NaN,1190038.0,ta,En Purushan Kuzhanthai Mathiri,A man gets involved with another woman just a ...,0.600,/1slURPfKBY2qCUbSMqHvFD9WzGX.jpg,"[{'id': 210761, 'logo_path': None, 'name': 'RR...",[],2001-03-09,0.0,146.0,"[{'english_name': 'Tamil', 'iso_639_1': 'ta', ...",Released,NaN,En Purushan Kuzhanthai Mathiri,0.0,0.000,0.0,NaN
2356,tt6920966,0.0,NaN,NaN,0.0,"[{'id': 80, 'name': 'Crime'}, {'id': 18, 'name...",NaN,1135565.0,cn,熱血刑警,NaN,0.826,/m8Smi3IGkDeDQvhZfYncGCvIA9K.jpg,[],[],2000-01-18,0.0,92.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,NaN,Bloody Cops,0.0,0.000,0.0,NaN
2357,tt7795706,0.0,NaN,NaN,0.0,"[{'id': 27, 'name': 'Horror'}]",NaN,739422.0,fr,Edmund Kemper - Part 1: La mort de ma vie,Underground French necrophilia nastiness,0.853,/zI6apLCmu4au78ViP80amiLU7eB.jpg,"[{'id': 139554, 'logo_path': None, 'name': 'Am...",[],2001-12-18,0.0,56.0,"[{'english_name': 'French', 'iso_639_1': 'fr',...",Released,NaN,Edmund Kemper - Part 1: La mort de ma vie,0.0,0.000,0.0,NaN
2358,tt9212730,0.0,NaN,NaN,0.0,"[{'id': 27, 'name': 'Horror'}, {'id': 53, 'nam...",NaN,382630.0,ja,実録外伝 ゾンビ極道,Yakuza Zombie opens with an introduction to a ...,2.163,/2UxCpo1R2IcCF7c8KkZDvt81JbS.jpg,"[{'id': 73158, 'logo_path': None, 'name': 'Jap...","[{'iso_3166_1': 'JP', 'name': 'Japan'}]",2001-02-15,0.0,88.0,"[{'english_name': 'Japanese', 'iso_639_1': 'ja...",Released,NaN,Yakuza Zombie,0.0,0.000,0.0,NaN

# Transform

## basics

- normalize and separate genre
- "original_title" (we will use the primary title column instead)
- "isAdult" ("Adult" will show up in the genres so this is redundant information).
- "titleType" (every row will be a movie).
- "genres" and other variants of genre (genre is now represented in the 2 new tables described above.

In [8]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 138722 entries, 0 to 138721
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          138722 non-null  object
 1   titleType       138722 non-null  object
 2   primaryTitle    138722 non-null  object
 3   originalTitle   138722 non-null  object
 4   isAdult         138722 non-null  int64
 5   startYear       138722 non-null  float64
 6   endYear         0 non-null       float64
 7   runtimeMinutes  138722 non-null  int64
 8   genres          138722 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 9.5+ MB

In [9]:
cols_to_drop = ['originalTitle','isAdult','titleType','endYear'] #endYear not req'd
basics = basics.drop(columns=cols_to_drop)
basics

,tconst,primaryTitle,startYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama
3,tt0082328,Embodiment of Evil,2008.0,94,Horror
4,tt0088751,The Naked Monster,2005.0,100,"Comedy,Horror,Sci-Fi"
...,...,...,...,...,...
138717,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller"
138718,tt9916270,Il talento del calabrone,2020.0,84,Thriller
138719,tt9916362,Coven,2020.0,92,"Drama,History"
138720,tt9916538,Kuambil Lagi Hatiku,2019.0,123,Drama
138721,tt9916730,6 Gunn,2017.0,116,Drama

### Normalizing Genre

In [10]:
## Fill Missing Genres 
## Create a new column with the single-string genres as a list of strings
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama,[Drama]
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama,[Drama]
3,tt0082328,Embodiment of Evil,2008.0,94,Horror,[Horror]
4,tt0088751,The Naked Monster,2005.0,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
...,...,...,...,...,...,...
138717,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
138718,tt9916270,Il talento del calabrone,2020.0,84,Thriller,[Thriller]
138719,tt9916362,Coven,2020.0,92,"Drama,History","[Drama, History]"
138720,tt9916538,Kuambil Lagi Hatiku,2019.0,123,Drama,[Drama]
138721,tt9916730,6 Gunn,2017.0,116,Drama,[Drama]

In [11]:
## Explode the dataframe to make each genre into a separate row
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama,Drama
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama,Drama
...,...,...,...,...,...,...
138718,tt9916270,Il talento del calabrone,2020.0,84,Thriller,Thriller
138719,tt9916362,Coven,2020.0,92,"Drama,History",Drama
138719,tt9916362,Coven,2020.0,92,"Drama,History",History
138720,tt9916538,Kuambil Lagi Hatiku,2019.0,123,Drama,Drama
138721,tt9916730,6 Gunn,2017.0,116,Drama,Drama

#### Create title_genres Table - title_genres
tconst: GenreID

In [12]:
## Save just tconst and genres_split as new df
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

#### Replacing Text Genres with Integer IDs

In [13]:
## Getting unique list of genres
unique_genres = sorted(title_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [14]:
## Make a dictionary with list of unique genres as the key and the new iteger id as vlaues
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

#### Replacing Values in title_genres Table with Genre ID

In [15]:
## Use .map or .replace with our genre_id_map dictionary
title_genres['Genre_ID'] = title_genres['genres_split'].replace(genre_id_map)

## Drop the original genre column
title_genres.drop(columns=['genres_split'],inplace=True)
title_genres

           tconst  Genre_ID
0       tt0035423         5
0       tt0035423         9
0       tt0035423        18
1       tt0062336         7
2       tt0069049         7
...           ...       ...
138718  tt9916270        22
138719  tt9916362         7
138719  tt9916362        11
138720  tt9916538         7
138721  tt9916730         7

[241997 rows x 2 columns]

#### Create `genres` table
- Genre : Genre_ID

In [16]:
## Manaully make dataframe with named cols from the .keyd and .values
genre_lookup = pd.DataFrame({'Genre_Name': genre_id_map.keys(),
                             'Genre_ID':genre_id_map.values()})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [17]:
## Dropping original genre columns 
basics = basics.drop(columns=['genres','genres_split'])
basics

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0082328,Embodiment of Evil,2008.0,94
4,tt0088751,The Naked Monster,2005.0,100
...,...,...,...,...
138717,tt9916190,Safeguard,2020.0,95
138718,tt9916270,Il talento del calabrone,2020.0,84
138719,tt9916362,Coven,2020.0,92
138720,tt9916538,Kuambil Lagi Hatiku,2019.0,123
138721,tt9916730,6 Gunn,2017.0,116

# LOAD

## Connect to MySQL

In [25]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *
from urllib.parse import quote_plus as urlquote

In [26]:
## Getting mysql server password
import json
with open('/Users/purvikansara/.secret/mysql.json') as f:
    login = json.load(f)

login.keys()

dict_keys(['username', 'password'])

In [28]:
## create a new movies database
connect_str = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/movies"

In [29]:
## Check if database exists, if not, create it
if database_exists(connect_str) == False:
    print("Creating the database.")
    create_database(connect_str)
else:
    print('The database already exists.')

The database already exists.

In [30]:
## create engine
engine = create_engine(connect_str)

In [31]:
## Test your connection by checking for any tables that exist (there should be none at this point)
q = """SHOW TABLES;"""
tables = pd.read_sql(q, engine)
tables

  Tables_in_movies
0           genres
1     title_basics
2      title_genre
3     title_genres
4    title_ratings
5        tmdb_data
6    tmdb_data_aab
7    tmdb_data_mvp

### Saving`title_basics` to db

In [32]:
## saving text length
key_len = basics['tconst'].map(len).max()
title_len = basics['primaryTitle'].map(len).max()
key_len, title_len

(10, 242)

In [33]:
basics_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'runtimeMinutes':Integer()
    }
basics_schema

{'tconst': String(length=11),
 'primaryTitle': Text(length=243),
 'startYear': Float(),
 'runtimeMinutes': Integer()}

In [34]:
basics

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0082328,Embodiment of Evil,2008.0,94
4,tt0088751,The Naked Monster,2005.0,100
...,...,...,...,...
138717,tt9916190,Safeguard,2020.0,95
138718,tt9916270,Il talento del calabrone,2020.0,84
138719,tt9916362,Coven,2020.0,92
138720,tt9916538,Kuambil Lagi Hatiku,2019.0,123
138721,tt9916730,6 Gunn,2017.0,116

In [35]:
## Saving basics as table with schema,
basics.to_sql('title_basics',engine,dtype=basics_schema,if_exists='replace',index=False)

## setting title basics as the primary key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [36]:
## query first rows 
q = """SELECT * FROM title_basics LIMIT 5"""
pd.read_sql(q,engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0082328,Embodiment of Evil,2008.0,94
4,tt0088751,The Naked Monster,2005.0,100

### Saving Genre Tables

#### Saving genre_lookup

In [37]:
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [38]:
## Primary key is Genre_ID
genre_lookup.to_sql('genres',engine,index=False, if_exists='replace')

engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_ID`);')

In [39]:
q = """SELECT * FROM genres LIMIT 5"""
pd.read_sql(q,engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

#### Saving `title_genres` table

In [40]:
## NO PRIMARY KEY - DUPLCIATE VALUES
title_genres.to_sql('title_genres',engine,index=False,
                    if_exists='replace' )

# engine.execute('ALTER TABLE title_genres ADD PRIMARY KEY (`tconst`);')

241997

In [41]:
q = """SELECT * FROM title_genres LIMIT 5"""
pd.read_sql(q,engine)

      tconst  Genre_ID
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

### Saving `title_ratings`

In [42]:
ratings_schema = {'tconst':String(key_len+1), 
                 'averageRating':Float(),
                 'numVotes':Integer()}#get_schema(ratings)
ratings_schema

{'tconst': String(length=11), 'averageRating': Float(), 'numVotes': Integer()}

In [43]:
ratings.to_sql('title_ratings',engine,if_exists='replace',index=False,
              dtype=ratings_schema)
engine.execute("ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`)")

In [44]:
q = """SELECT * FROM title_ratings LIMIT 5"""
pd.read_sql(q,engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      2007
1  tt0000002            5.8       269
2  tt0000005            6.2      2692
3  tt0000006            5.0       182
4  tt0000007            5.4       841

### Saving TMDB API Data

In [45]:
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6989 entries, 1 to 2358
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                6989 non-null   object
 1   adult                  6989 non-null   float64
 2   backdrop_path          3157 non-null   object
 3   belongs_to_collection  408 non-null    object
 4   budget                 6989 non-null   float64
 5   genres                 6989 non-null   object
 6   homepage               376 non-null    object
 7   id                     6989 non-null   float64
 8   original_language      6989 non-null   object
 9   original_title         6989 non-null   object
 10  overview               6440 non-null   object
 11  popularity             6989 non-null   float64
 12  poster_path            5977 non-null   object
 13  production_companies   6989 non-null   object
 14  production_countries   6989 non-null   object
 15  release_date           6902 non-null   object
 16  revenue                6989 non-null   float64
 17  runtime                6989 non-null   float64
 18  spoken_languages       6989 non-null   object
 19  status                 6989 non-null   object
 20  tagline                1956 non-null   object
 21  title                  6989 non-null   object
 22  video                  6989 non-null   float64
 23  vote_average           6989 non-null   float64
 24  vote_count             6989 non-null   float64
 25  certification          1256 non-null   object
dtypes: float64(9), object(17)
memory usage: 1.4+ MB

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,overview,popularity,poster_path,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,Two rural teens sing and dance their way throu...,2.838,/hfO64mXz3DgUxkBVU7no2UWRP7x.jpg,"[{'id': 60, 'logo_path': '/2eqFolQI0NLL7ExZts5...","[{'iso_3166_1': 'US', 'name': 'United States o...",2000-09-22,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,Earth is in a state of constant war and two co...,2.410,/h9bWO13nWRGZJo4XVPiElXyrRMU.jpg,"[{'id': 925, 'logo_path': '/dIb9hjXNOkgxu4kBWd...","[{'iso_3166_1': 'US', 'name': 'United States o...",2000-11-15,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,"After falling prey to underworld, four friends...",0.655,/yB5wRu4uyXXwZA3PEj8cITu0xt3.jpg,[],"[{'iso_3166_1': 'IN', 'name': 'India'}]",2000-04-14,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,0.000,0.0,NaN
4,tt0116748,0.0,/wr0hTHwkYIRC82MwNbhOvqrw27N.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,579396.0,hi,Karobaar,Wealthy Rajiv Sinha and middle-classed Amar Sa...,0.600,/wFSOXXrJklY2ngjIJCus9c2DfJW.jpg,[],[],2000-09-15,0.0,180.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,The Business of Love,Karobaar,0.0,5.500,2.0,NaN
5,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,"Hong Kong, 1962: Chow Mo-Wan and Su Li-Zhen mo...",21.023,/iYypPT4bhqXfq1b6EnmxvRt6b2Y.jpg,"[{'id': 539, 'logo_path': None, 'name': 'Block...","[{'iso_3166_1': 'FR', 'name': 'France'}, {'iso...",2000-09-29,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.111,1979.0,PG

In [46]:
## Keeping some columns
cols_to_keep = ['imdb_id','budget','revenue','certification',
                'original_language']
tmdb = df[cols_to_keep]
tmdb

        imdb_id      budget     revenue certification original_language
1     tt0113026  10000000.0         0.0           NaN                en
2     tt0113092         0.0         0.0           NaN                en
3     tt0116391         0.0         0.0           NaN                hi
4     tt0116748         0.0         0.0           NaN                hi
5     tt0118694    150000.0  12854953.0            PG                cn
...         ...         ...         ...           ...               ...
2354  tt6103018         0.0         0.0           NaN                ru
2355  tt6536876         0.0         0.0           NaN                ta
2356  tt6920966         0.0         0.0           NaN                cn
2357  tt7795706         0.0         0.0           NaN                fr
2358  tt9212730         0.0         0.0           NaN                ja

[6989 rows x 5 columns]

In [47]:
tmdb.isna().sum()

imdb_id                 0
budget                  0
revenue                 0
certification        5733
original_language       0
dtype: int64

In [48]:
tmdb

        imdb_id      budget     revenue certification original_language
1     tt0113026  10000000.0         0.0           NaN                en
2     tt0113092         0.0         0.0           NaN                en
3     tt0116391         0.0         0.0           NaN                hi
4     tt0116748         0.0         0.0           NaN                hi
5     tt0118694    150000.0  12854953.0            PG                cn
...         ...         ...         ...           ...               ...
2354  tt6103018         0.0         0.0           NaN                ru
2355  tt6536876         0.0         0.0           NaN                ta
2356  tt6920966         0.0         0.0           NaN                cn
2357  tt7795706         0.0         0.0           NaN                fr
2358  tt9212730         0.0         0.0           NaN                ja

[6989 rows x 5 columns]

In [49]:
## saving text length
key_len = tmdb['imdb_id'].map(len).max()
cert_len = tmdb['certification'].fillna('').map(len).max()
lang_len = tmdb['original_language'].map(len).max()

key_len, cert_len,lang_len

(10, 7, 2)

In [50]:
## saving schema
api_data_schema = {'imdb_id':String(key_len+1), 
                 'budget':Float(),
                   'revenue':Float(),
                 'certification':Text(cert_len+1),
                  'original_language':Text(lang_len+1)}
api_data_schema

{'imdb_id': String(length=11),
 'budget': Float(),
 'revenue': Float(),
 'certification': Text(length=8),
 'original_language': Text(length=3)}

In [51]:
tmdb = tmdb.drop_duplicates(subset=['imdb_id'])

In [52]:
# saving tmdb version
## Primary key is Genre_ID
tmdb.to_sql('tmdb_data',engine, index=False,dtype=api_data_schema, if_exists='replace')

engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [53]:
q = """SELECT * FROM tmdb_data LIMIT 5"""
pd.read_sql(q,engine)

     imdb_id      budget     revenue certification original_language
0  tt0035423  48000000.0  76019000.0         PG-13                en
1  tt0079644         0.0         0.0          None                id
2  tt0089067         0.0         0.0          None                es
3  tt0096056         0.0         0.0          None                en
4  tt0113026  10000000.0         0.0          None                en

In [54]:
df.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,overview,popularity,poster_path,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,Two rural teens sing and dance their way throu...,2.838,/hfO64mXz3DgUxkBVU7no2UWRP7x.jpg,"[{'id': 60, 'logo_path': '/2eqFolQI0NLL7ExZts5...","[{'iso_3166_1': 'US', 'name': 'United States o...",2000-09-22,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,Earth is in a state of constant war and two co...,2.410,/h9bWO13nWRGZJo4XVPiElXyrRMU.jpg,"[{'id': 925, 'logo_path': '/dIb9hjXNOkgxu4kBWd...","[{'iso_3166_1': 'US', 'name': 'United States o...",2000-11-15,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,"After falling prey to underworld, four friends...",0.655,/yB5wRu4uyXXwZA3PEj8cITu0xt3.jpg,[],"[{'iso_3166_1': 'IN', 'name': 'India'}]",2000-04-14,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,0.000,0.0,NaN
4,tt0116748,0.0,/wr0hTHwkYIRC82MwNbhOvqrw27N.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,579396.0,hi,Karobaar,Wealthy Rajiv Sinha and middle-classed Amar Sa...,0.600,/wFSOXXrJklY2ngjIJCus9c2DfJW.jpg,[],[],2000-09-15,0.0,180.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,The Business of Love,Karobaar,0.0,5.500,2.0,NaN
5,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,"Hong Kong, 1962: Chow Mo-Wan and Su Li-Zhen mo...",21.023,/iYypPT4bhqXfq1b6EnmxvRt6b2Y.jpg,"[{'id': 539, 'logo_path': None, 'name': 'Block...","[{'iso_3166_1': 'FR', 'name': 'France'}, {'iso...",2000-09-29,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.111,1979.0,PG

In [55]:
# def get_schema(table,debug=False):
#     ## save pandas dtypes in list, make empty dict
#     dtypes = table.dtypes
#     schema = {}
    
#     # for each column
#     for col in dtypes.index:
#         ## print info if in debug mode
#         if debug:
#             print(f"{col} = {dtypes.loc[col]}")

#         ## if its a string column (object)
#         if dtypes.loc[col]=='object':
            
#             ## Fill null values and make sure whole column is str
#             data = table[col].fillna('').astype(str)
            
#             ## get len first
#             len_str = data.map(len).max()
            
#             ## if the string is shorter than 21845 use String
#             # (forget how i knew it was max size)
#             if len_str < 21845:
#                 schema[col] = String( len_str + 1)
                
#             ## If longer use Text
#             else:
#                 schema[col] = Text(len_str+1)
        
#         # if float make Float
#         elif dtypes.loc[col] == 'float':
#             schema[col] = Float()

#         ## if int make Integer
#         elif dtypes.loc[col] == 'int':
#             schema[col] = Integer()
            
#         ## if bool make Boolean
#         elif dtypes.loc[col] == 'bool':
#             schema[col] = Boolean()
            
#     return schema

# Final Tables Check

In [56]:
## Test your connection by checking for any tables that exist (there should be none at this point)
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2      title_genre
3     title_genres
4    title_ratings
5        tmdb_data
6    tmdb_data_aab
7    tmdb_data_mvp